; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 752436 1 3 4 4 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image3 - mode
	spectrograph2 - mode
	thermograph0 - mode
	infrared1 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star0 - direction
	Star3 - direction
	Planet4 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
)
(:init
	(supports instrument0 image3)
	(calibration_target instrument0 Star3)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph2)
	(supports instrument1 image3)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star0)
	(supports instrument2 image3)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
)
(:goal (and
	(have_image Planet4 spectrograph2)
	(have_image Star5 infrared1)
	(have_image Planet6 image3)
	(have_image Planet7 image3)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 4
2. (turn_to satellite0 star5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star5)
   goals met: 0 of 4
3. (turn_to satellite0 star0 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star0)
   goals met: 0 of 4
4. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 4
5. (turn_to satellite0 star5 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star5)
   goals met: 0 of 4
6. (take_image satellite0 star5 instrument1 infrared1)
   added: (have_image star5 infrared1)
   goals met: 1 of 4
7. (turn_to satellite0 planet7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet7)
   goals met: 1 of 4
8. (take_image satellite0 planet7 instrument1 image3)
   added: (have_image planet7 image3)
   goals met: 2 of 4
9. (turn_to satellite0 planet6 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet6)
   goals met: 2 of 4
10. (take_image satellite0 planet6 instrument1 image3)
   added: (have_image planet6 image3)
   goals met: 3 of 4
11. (turn_to satellite0 planet4 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet4)
   goals met: 3 of 4
12. (take_image satellite0 planet4 instrument1 spectrograph2)
   added: (have_image planet4 spectrograph2)
   goals met: 4 of 4
